esp-cpp/espp/components/canopen/can_bridge_example/sdkconfig.defaults
# The USB vendor / WebUSB + CDC transports use the native USB-OTG peripheral,
# available on the ESP32-S3 (also S2 / P4) -- NOT the classic ESP32. Pin the
# target so a bare `idf.py build` does not fall back to esp32.
CONFIG_IDF_TARGET="esp32s3"

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Console on UART0. On the ESP32-S3 (and -P4) USB-Serial-JTAG shares the native
# USB port's PHY with USB-OTG, which TinyUSB takes over for espp::UsbDevice's
# interfaces: a primary console on USB-Serial-JTAG contends with them for that one
# port and the device is unusable over USB. UART0 is an independent peripheral, so
# the console always has a place to go (connect a USB-UART adapter to UART0 for
# `idf.py monitor`).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# USB-Serial-JTAG stays the SECONDARY console so early-boot / bootloader logs are
# still visible on the native USB port before the app brings up TinyUSB.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Enable the TinyUSB vendor + CDC class drivers. The vendor interface carries
# the framed protocol for WebUSB; the CDC interface carries the SAME framed
# protocol for Web Serial. HID count is set only so the usb_device component's
# HID code paths compile (no HID interface is instantiated here). esp_tinyusb
# gates each class behind these counts.
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1

# Give the vendor RX/TX FIFOs headroom for CAN-RX frame bursts on a busy bus.
CONFIG_TINYUSB_VENDOR_RX_BUFSIZE=2048
CONFIG_TINYUSB_VENDOR_TX_BUFSIZE=2048

# C++
CONFIG_COMPILER_CXX_EXCEPTIONS=y
